64U128G/memcachedTestResult/memcachedMultiCoreTestResult-13nd-myBenchMark-100G-random-interleave/F-2nd/memcached_test_result_random_F_OFF_3nd_20230814131754.log
20        Threads
5         Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---             ---             ---             ---             ---         0.00 
Gets      1200521.20   1200521.20         0.00         2.65919         2.19100        11.32700        19.45500   1270724.44 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1200521.20   1200521.20         0.00         2.65919         2.19100        11.32700        19.45500   1270724.44 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.000      100.000
---
GET       0.183        0.000
GET       1.287        5.000
GET       1.519       10.000
GET       1.663       15.000
GET       1.775       20.000
GET       1.855       25.000
GET       1.919       30.000
GET       1.983       35.000
GET       2.047       40.000
GET       2.127       45.000
GET       2.191       50.000
GET       2.239       52.500
GET       2.287       55.000
GET       2.335       57.500
GET       2.399       60.000
GET       2.463       62.500
GET       2.543       65.000
GET       2.623       67.500
GET       2.719       70.000
GET       2.831       72.500
GET       2.943       75.000
GET       2.991       76.250
GET       3.055       77.500
GET       3.135       78.750
GET       3.199       80.000
GET       3.263       81.250
GET       3.343       82.500
GET       3.423       83.750
GET       3.519       85.000
GET       3.615       86.250
GET       3.711       87.500
GET       3.759       88.125
GET       3.823       88.750
GET       3.887       89.375
GET       3.951       90.000
GET       4.031       90.625
GET       4.127       91.250
GET       4.223       91.875
GET       4.319       92.500
GET       4.447       93.125
GET       4.607       93.750
GET       4.703       94.062
GET       4.831       94.375
GET       4.959       94.688
GET       5.087       95.000
GET       5.247       95.312
GET       5.439       95.625
GET       5.631       95.938
GET       5.855       96.250
GET       6.143       96.562
GET       6.431       96.875
GET       6.591       97.031
GET       6.783       97.188
GET       6.975       97.344
GET       7.167       97.500
GET       7.391       97.656
GET       7.647       97.812
GET       7.935       97.969
GET       8.255       98.125
GET       8.639       98.281
GET       9.087       98.438
GET       9.343       98.516
GET       9.599       98.594
GET       9.919       98.672
GET      10.239       98.750
GET      10.559       98.828
GET      10.879       98.906
GET      11.263       98.984
GET      11.583       99.062
GET      11.967       99.141
GET      12.351       99.219
GET      12.543       99.258
GET      12.735       99.297
GET      12.991       99.336
GET      13.183       99.375
GET      13.503       99.414
GET      13.759       99.453
GET      14.143       99.492
GET      14.463       99.531
GET      14.847       99.570
GET      15.231       99.609
GET      15.423       99.629
GET      15.615       99.648
GET      15.807       99.668
GET      16.063       99.688
GET      16.319       99.707
GET      16.639       99.727
GET      16.895       99.746
GET      17.151       99.766
GET      17.407       99.785
GET      17.791       99.805
GET      17.919       99.814
GET      18.047       99.824
GET      18.303       99.834
GET      18.431       99.844
GET      18.559       99.854
GET      18.815       99.863
GET      18.943       99.873
GET      19.199       99.883
GET      19.327       99.893
GET      19.583       99.902
GET      19.711       99.907
GET      19.839       99.912
GET      20.095       99.917
GET      20.223       99.922
GET      20.479       99.927
GET      20.863       99.932
GET      21.247       99.937
GET      21.631       99.941
GET      21.887       99.946
GET      22.271       99.951
GET      22.527       99.954
GET      22.655       99.956
GET      22.911       99.958
GET      23.039       99.961
GET      23.295       99.963
GET      23.423       99.966
GET      23.679       99.968
GET      24.063       99.971
GET      24.447       99.973
GET      24.959       99.976
GET      25.215       99.977
GET      25.471       99.978
GET      25.727       99.979
GET      25.983       99.980
GET      26.239       99.982
GET      26.495       99.983
GET      26.751       99.984
GET      27.007       99.985
GET      27.135       99.987
GET      27.391       99.988
GET      27.519       99.988
GET      27.775       99.989
GET      27.903       99.990
GET      28.159       99.990
GET      28.415       99.991
GET      28.671       99.991
GET      28.927       99.992
GET      29.311       99.993
GET      29.695       99.993
GET      30.079       99.994
GET      30.207       99.994
GET      30.335       99.995
GET      30.463       99.995
GET      30.719       99.995
GET      30.847       99.995
GET      30.975       99.996
GET      31.103       99.996
GET      31.231       99.996
GET      31.487       99.997
GET      31.615       99.997
GET      31.743       99.997
GET      31.871       99.997
GET      31.999       99.997
GET      32.255       99.998
GET      32.383       99.998
GET      32.511       99.998
GET      32.767       99.998
GET      33.023       99.998
GET      33.535       99.998
GET      33.791       99.998
GET      34.047       99.999
GET      34.303       99.999
GET      34.303       99.999
GET      34.559       99.999
GET      34.815       99.999
GET      35.071       99.999
GET      35.327       99.999
GET      35.839       99.999
GET      36.095       99.999
GET      36.351       99.999
GET      36.351       99.999
GET      36.607       99.999
GET      36.863       99.999
GET      36.863       99.999
GET      37.119       99.999
GET      37.631       99.999
GET      37.887      100.000
GET      38.399      100.000
GET      38.911      100.000
GET      39.423      100.000
GET      39.679      100.000
GET      39.679      100.000
GET      39.935      100.000
GET      39.935      100.000
GET      40.191      100.000
GET      40.191      100.000
GET      40.447      100.000
GET      40.447      100.000
GET      40.703      100.000
GET      40.959      100.000
GET      40.959      100.000
GET      41.215      100.000
GET      41.471      100.000
GET      41.727      100.000
GET      41.983      100.000
GET      42.239      100.000
GET      42.751      100.000
GET      43.263      100.000
GET      43.519      100.000
GET      43.775      100.000
GET      44.031      100.000
GET      44.031      100.000
GET      44.031      100.000
[...]
GET      44.287      100.000
GET      44.287      100.000
GET      44.287      100.000
[...]
GET      44.543      100.000
GET      44.543      100.000
GET      44.543      100.000
GET      44.799      100.000
GET      44.799      100.000
GET      45.055      100.000
GET      45.311      100.000
GET      45.567      100.000
GET      45.567      100.000
GET      45.567      100.000
[...]
GET      45.823      100.000
GET      46.079      100.000
GET      46.335      100.000
GET      46.335      100.000
GET      46.591      100.000
GET      46.591      100.000
GET      47.615      100.000
GET      48.127      100.000
GET      48.383      100.000
GET      48.895      100.000
GET      48.895      100.000
GET      49.151      100.000
GET      49.919      100.000
GET      50.943      100.000
GET      52.223      100.000
GET      52.479      100.000
GET      54.527      100.000
GET      54.527      100.000
GET      54.783      100.000
GET      54.783      100.000
GET      54.783      100.000
GET      55.039      100.000
GET      55.039      100.000
GET      55.039      100.000
[...]
GET      55.295      100.000
GET      55.295      100.000
GET      55.295      100.000
[...]
GET      56.063      100.000
GET      56.063      100.000
GET      56.319      100.000
GET      56.319      100.000
GET      56.319      100.000
[...]
GET      56.831      100.000
GET      56.831      100.000
GET      56.831      100.000
[...]
GET      57.343      100.000
GET      57.343      100.000
GET      57.343      100.000
[...]
GET      57.855      100.000
GET      57.855      100.000
GET      57.855      100.000
[...]
GET      58.111      100.000
GET      58.111      100.000
---
WAIT      0.000      100.000